
# Auto-generated by Interface Designer
#
# WARNING: Any manual changes made to this file will be lost when generating constraints.

# Efinity Interface Designer SDC
# Version: 2025.2.288.3.8
# Date: 2026-04-22 10:45

# Copyright (C) 2013 - 2025 Efinix Inc. All rights reserved.

# Device: T120F576
# Project: edge_vision_soc
# Timing Model: C4 (final)

# PLL Constraints
###################
create_clock -period 10.000 -name mipi_pclk [get_ports {mipi_pclk}]
create_clock -period 10.000 -name mipi_cal_clk [get_ports {mipi_cal_clk}]
create_clock -period 26.936 -name tx_slowclk [get_ports {tx_slowclk}]
create_clock -waveform {1.924 5.772} -period 7.696 -name tx_fastclk [get_ports {tx_fastclk}]
create_clock -period 2.500 -name ddr_clk [get_ports {ddr_clk}]
create_clock -period 10.000 -name axi_clk [get_ports {axi_clk}]
create_clock -period 10.000 -name soc_clk [get_ports {soc_clk}]
create_clock -period 15.714 -name dma_clk [get_ports {dma_clk}]
create_clock -period 100 [get_ports {jtag_inst1_TCK}]

set_clock_groups -exclusive -group {dma_clk} -group {axi_clk} -group {soc_clk} -group {tx_slowclk} -group {mipi_pclk} -group {jtag_inst1_TCK}

# GPIO Constraints
####################
# set_output_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -max <MAX CALCULATION> [get_ports {hdmi_rstn}]
# set_output_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -min <MIN CALCULATION> [get_ports {hdmi_rstn}]
set_output_delay -clock soc_clk -reference_pin [get_ports {soc_clk~CLKOUT~1~43}] -max 0.610 [get_ports {system_spi_0_io_sclk_write}]
set_output_delay -clock soc_clk -reference_pin [get_ports {soc_clk~CLKOUT~1~43}] -min -0.085 [get_ports {system_spi_0_io_sclk_write}]
set_output_delay -clock soc_clk -reference_pin [get_ports {soc_clk~CLKOUT~1~41}] -max 0.610 [get_ports {system_spi_0_io_ss}]
set_output_delay -clock soc_clk -reference_pin [get_ports {soc_clk~CLKOUT~1~41}] -min -0.085 [get_ports {system_spi_0_io_ss}]
set_input_delay -clock soc_clk -reference_pin [get_ports {soc_clk~CLKOUT~1~66}] -max 0.858 [get_ports {system_spi_0_io_data_0_read}]
set_input_delay -clock soc_clk -reference_pin [get_ports {soc_clk~CLKOUT~1~66}] -min 0.429 [get_ports {system_spi_0_io_data_0_read}]
set_output_delay -clock soc_clk -reference_pin [get_ports {soc_clk~CLKOUT~1~67}] -max 0.610 [get_ports {system_spi_0_io_data_0_write}]
set_output_delay -clock soc_clk -reference_pin [get_ports {soc_clk~CLKOUT~1~67}] -min -0.085 [get_ports {system_spi_0_io_data_0_write}]
set_output_delay -clock soc_clk -reference_pin [get_ports {soc_clk~CLKOUT~1~67}] -max 0.603 [get_ports {system_spi_0_io_data_0_writeEnable}]
set_output_delay -clock soc_clk -reference_pin [get_ports {soc_clk~CLKOUT~1~67}] -min -0.088 [get_ports {system_spi_0_io_data_0_writeEnable}]
set_input_delay -clock soc_clk -reference_pin [get_ports {soc_clk~CLKOUT~1~69}] -max 0.858 [get_ports {system_spi_0_io_data_1_read}]
set_input_delay -clock soc_clk -reference_pin [get_ports {soc_clk~CLKOUT~1~69}] -min 0.429 [get_ports {system_spi_0_io_data_1_read}]
set_output_delay -clock soc_clk -reference_pin [get_ports {soc_clk~CLKOUT~1~70}] -max 0.610 [get_ports {system_spi_0_io_data_1_write}]
set_output_delay -clock soc_clk -reference_pin [get_ports {soc_clk~CLKOUT~1~70}] -min -0.085 [get_ports {system_spi_0_io_data_1_write}]
set_output_delay -clock soc_clk -reference_pin [get_ports {soc_clk~CLKOUT~1~70}] -max 0.603 [get_ports {system_spi_0_io_data_1_writeEnable}]
set_output_delay -clock soc_clk -reference_pin [get_ports {soc_clk~CLKOUT~1~70}] -min -0.088 [get_ports {system_spi_0_io_data_1_writeEnable}]

# LVDS RX GPIO Constraints
############################
# set_input_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -max <MAX CALCULATION> [get_ports {system_uart_0_io_rxd}]
# set_input_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -min <MIN CALCULATION> [get_ports {system_uart_0_io_rxd}]
# set_input_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -max <MAX CALCULATION> [get_ports {user_dip0}]
# set_input_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -min <MIN CALCULATION> [get_ports {user_dip0}]
# set_input_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -max <MAX CALCULATION> [get_ports {user_dip1}]
# set_input_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -min <MIN CALCULATION> [get_ports {user_dip1}]
# set_output_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -max <MAX CALCULATION> [get_ports {cam1_rstn}]
# set_output_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -min <MIN CALCULATION> [get_ports {cam1_rstn}]
# set_output_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -max <MAX CALCULATION> [get_ports {system_uart_0_io_txd}]
# set_output_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -min <MIN CALCULATION> [get_ports {system_uart_0_io_txd}]
# set_output_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -max <MAX CALCULATION> [get_ports {user_led2}]
# set_output_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -min <MIN CALCULATION> [get_ports {user_led2}]
# set_output_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -max <MAX CALCULATION> [get_ports {user_led3}]
# set_output_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -min <MIN CALCULATION> [get_ports {user_led3}]
# set_input_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -max <MAX CALCULATION> [get_ports {mipi_i2c_0_io_scl_read}]
# set_input_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -min <MIN CALCULATION> [get_ports {mipi_i2c_0_io_scl_read}]
# set_output_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -max <MAX CALCULATION> [get_ports {mipi_i2c_0_io_scl_write}]
# set_output_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -min <MIN CALCULATION> [get_ports {mipi_i2c_0_io_scl_write}]
# set_output_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -max <MAX CALCULATION> [get_ports {mipi_i2c_0_io_scl_writeEnable}]
# set_output_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -min <MIN CALCULATION> [get_ports {mipi_i2c_0_io_scl_writeEnable}]
# set_input_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -max <MAX CALCULATION> [get_ports {mipi_i2c_0_io_sda_read}]
# set_input_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -min <MIN CALCULATION> [get_ports {mipi_i2c_0_io_sda_read}]
# set_output_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -max <MAX CALCULATION> [get_ports {mipi_i2c_0_io_sda_write}]
# set_output_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -min <MIN CALCULATION> [get_ports {mipi_i2c_0_io_sda_write}]
# set_output_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -max <MAX CALCULATION> [get_ports {mipi_i2c_0_io_sda_writeEnable}]
# set_output_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -min <MIN CALCULATION> [get_ports {mipi_i2c_0_io_sda_writeEnable}]

# LVDS TX GPIO Constraints
############################
# set_input_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -max <MAX CALCULATION> [get_ports {hdmi_i2c_1_io_scl_read}]
# set_input_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -min <MIN CALCULATION> [get_ports {hdmi_i2c_1_io_scl_read}]
# set_output_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -max <MAX CALCULATION> [get_ports {hdmi_i2c_1_io_scl_write}]
# set_output_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -min <MIN CALCULATION> [get_ports {hdmi_i2c_1_io_scl_write}]
# set_output_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -max <MAX CALCULATION> [get_ports {hdmi_i2c_1_io_scl_writeEnable}]
# set_output_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -min <MIN CALCULATION> [get_ports {hdmi_i2c_1_io_scl_writeEnable}]
# set_input_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -max <MAX CALCULATION> [get_ports {hdmi_i2c_1_io_sda_read}]
# set_input_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -min <MIN CALCULATION> [get_ports {hdmi_i2c_1_io_sda_read}]
# set_output_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -max <MAX CALCULATION> [get_ports {hdmi_i2c_1_io_sda_write}]
# set_output_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -min <MIN CALCULATION> [get_ports {hdmi_i2c_1_io_sda_write}]
# set_output_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -max <MAX CALCULATION> [get_ports {hdmi_i2c_1_io_sda_writeEnable}]
# set_output_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -min <MIN CALCULATION> [get_ports {hdmi_i2c_1_io_sda_writeEnable}]

# LVDS Tx Constraints
#######################
set_output_delay -clock tx_slowclk -reference_pin [get_ports {tx_slowclk~CLKOUT~88~1}] -max 0.080 [get_ports {lvds_1a_DATA[*]}]
set_output_delay -clock tx_slowclk -reference_pin [get_ports {tx_slowclk~CLKOUT~88~1}] -min -0.080 [get_ports {lvds_1a_DATA[*]}]
set_output_delay -clock tx_slowclk -reference_pin [get_ports {tx_slowclk~CLKOUT~154~1}] -max 0.080 [get_ports {lvds_1b_DATA[*]}]
set_output_delay -clock tx_slowclk -reference_pin [get_ports {tx_slowclk~CLKOUT~154~1}] -min -0.080 [get_ports {lvds_1b_DATA[*]}]
set_output_delay -clock tx_slowclk -reference_pin [get_ports {tx_slowclk~CLKOUT~160~1}] -max 0.080 [get_ports {lvds_1c_DATA[*]}]
set_output_delay -clock tx_slowclk -reference_pin [get_ports {tx_slowclk~CLKOUT~160~1}] -min -0.080 [get_ports {lvds_1c_DATA[*]}]
set_output_delay -clock tx_slowclk -reference_pin [get_ports {tx_slowclk~CLKOUT~148~1}] -max 0.080 [get_ports {lvds_1d_DATA[*]}]
set_output_delay -clock tx_slowclk -reference_pin [get_ports {tx_slowclk~CLKOUT~148~1}] -min -0.080 [get_ports {lvds_1d_DATA[*]}]
set_output_delay -clock tx_slowclk -reference_pin [get_ports {tx_slowclk~CLKOUT~70~1}] -max 0.080 [get_ports {lvds_2a_DATA[*]}]
set_output_delay -clock tx_slowclk -reference_pin [get_ports {tx_slowclk~CLKOUT~70~1}] -min -0.080 [get_ports {lvds_2a_DATA[*]}]
set_output_delay -clock tx_slowclk -reference_pin [get_ports {tx_slowclk~CLKOUT~82~1}] -max 0.080 [get_ports {lvds_2b_DATA[*]}]
set_output_delay -clock tx_slowclk -reference_pin [get_ports {tx_slowclk~CLKOUT~82~1}] -min -0.080 [get_ports {lvds_2b_DATA[*]}]
set_output_delay -clock tx_slowclk -reference_pin [get_ports {tx_slowclk~CLKOUT~76~1}] -max 0.080 [get_ports {lvds_2c_DATA[*]}]
set_output_delay -clock tx_slowclk -reference_pin [get_ports {tx_slowclk~CLKOUT~76~1}] -min -0.080 [get_ports {lvds_2c_DATA[*]}]
set_output_delay -clock tx_slowclk -reference_pin [get_ports {tx_slowclk~CLKOUT~94~1}] -max 0.080 [get_ports {lvds_2d_DATA[*]}]
set_output_delay -clock tx_slowclk -reference_pin [get_ports {tx_slowclk~CLKOUT~94~1}] -min -0.080 [get_ports {lvds_2d_DATA[*]}]
set_output_delay -clock tx_slowclk -reference_pin [get_ports {tx_slowclk~CLKOUT~166~1}] -max 0.080 [get_ports {lvds_clk[*]}]
set_output_delay -clock tx_slowclk -reference_pin [get_ports {tx_slowclk~CLKOUT~166~1}] -min -0.080 [get_ports {lvds_clk[*]}]

# MIPI RX Constraints
#######################
set_output_delay -clock mipi_pclk -reference_pin [get_ports {mipi_pclk~CLKOUT~337~581}] -max 0.564 [get_ports {mipi_rx_inst1_VC_ENA[*]}]
set_output_delay -clock mipi_pclk -reference_pin [get_ports {mipi_pclk~CLKOUT~337~581}] -min -0.069 [get_ports {mipi_rx_inst1_VC_ENA[*]}]
set_output_delay -clock mipi_pclk -reference_pin [get_ports {mipi_pclk~CLKOUT~337~581}] -max 0.113 [get_ports {mipi_rx_inst1_CLEAR}]
set_output_delay -clock mipi_pclk -reference_pin [get_ports {mipi_pclk~CLKOUT~337~581}] -min -0.157 [get_ports {mipi_rx_inst1_CLEAR}]
set_input_delay -clock mipi_pclk -reference_pin [get_ports {mipi_pclk~CLKOUT~337~581}] -max 1.084 [get_ports {mipi_rx_inst1_VSYNC[*]}]
set_input_delay -clock mipi_pclk -reference_pin [get_ports {mipi_pclk~CLKOUT~337~581}] -min 0.542 [get_ports {mipi_rx_inst1_VSYNC[*]}]
set_input_delay -clock mipi_pclk -reference_pin [get_ports {mipi_pclk~CLKOUT~337~581}] -max 1.078 [get_ports {mipi_rx_inst1_HSYNC[*]}]
set_input_delay -clock mipi_pclk -reference_pin [get_ports {mipi_pclk~CLKOUT~337~581}] -min 0.539 [get_ports {mipi_rx_inst1_HSYNC[*]}]
set_input_delay -clock mipi_pclk -reference_pin [get_ports {mipi_pclk~CLKOUT~337~581}] -max 0.932 [get_ports {mipi_rx_inst1_VALID}]
set_input_delay -clock mipi_pclk -reference_pin [get_ports {mipi_pclk~CLKOUT~337~581}] -min 0.466 [get_ports {mipi_rx_inst1_VALID}]
set_input_delay -clock mipi_pclk -reference_pin [get_ports {mipi_pclk~CLKOUT~337~581}] -max 1.002 [get_ports {mipi_rx_inst1_CNT[*]}]
set_input_delay -clock mipi_pclk -reference_pin [get_ports {mipi_pclk~CLKOUT~337~581}] -min 0.501 [get_ports {mipi_rx_inst1_CNT[*]}]
set_input_delay -clock mipi_pclk -reference_pin [get_ports {mipi_pclk~CLKOUT~337~581}] -max 1.030 [get_ports {mipi_rx_inst1_DATA[*]}]
set_input_delay -clock mipi_pclk -reference_pin [get_ports {mipi_pclk~CLKOUT~337~581}] -min 0.515 [get_ports {mipi_rx_inst1_DATA[*]}]
set_input_delay -clock mipi_pclk -reference_pin [get_ports {mipi_pclk~CLKOUT~337~581}] -max 0.947 [get_ports {mipi_rx_inst1_ERR[*]}]
set_input_delay -clock mipi_pclk -reference_pin [get_ports {mipi_pclk~CLKOUT~337~581}] -min 0.474 [get_ports {mipi_rx_inst1_ERR[*]}]
set_input_delay -clock mipi_pclk -reference_pin [get_ports {mipi_pclk~CLKOUT~337~581}] -max 0.945 [get_ports {mipi_rx_inst1_ULPS_CLK}]
set_input_delay -clock mipi_pclk -reference_pin [get_ports {mipi_pclk~CLKOUT~337~581}] -min 0.473 [get_ports {mipi_rx_inst1_ULPS_CLK}]
set_input_delay -clock mipi_pclk -reference_pin [get_ports {mipi_pclk~CLKOUT~337~581}] -max 0.954 [get_ports {mipi_rx_inst1_ULPS[*]}]
set_input_delay -clock mipi_pclk -reference_pin [get_ports {mipi_pclk~CLKOUT~337~581}] -min 0.477 [get_ports {mipi_rx_inst1_ULPS[*]}]

# JTAG Constraints
####################
# create_clock -period <USER_PERIOD> -name jtag_inst1_TCK [get_ports {jtag_inst1_TCK}]
set_output_delay -clock jtag_inst1_TCK -max 0.111 [get_ports {jtag_inst1_TDO}]
set_output_delay -clock jtag_inst1_TCK -min -0.054 [get_ports {jtag_inst1_TDO}]
set_input_delay -clock_fall -clock jtag_inst1_TCK -max 0.267 [get_ports {jtag_inst1_CAPTURE}]
set_input_delay -clock_fall -clock jtag_inst1_TCK -min 0.134 [get_ports {jtag_inst1_CAPTURE}]
set_input_delay -clock_fall -clock jtag_inst1_TCK -max 0.267 [get_ports {jtag_inst1_RESET}]
set_input_delay -clock_fall -clock jtag_inst1_TCK -min 0.134 [get_ports {jtag_inst1_RESET}]
set_input_delay -clock_fall -clock jtag_inst1_TCK -max 0.231 [get_ports {jtag_inst1_SEL}]
set_input_delay -clock_fall -clock jtag_inst1_TCK -min 0.116 [get_ports {jtag_inst1_SEL}]
set_input_delay -clock_fall -clock jtag_inst1_TCK -max 0.267 [get_ports {jtag_inst1_UPDATE}]
set_input_delay -clock_fall -clock jtag_inst1_TCK -min 0.134 [get_ports {jtag_inst1_UPDATE}]
set_input_delay -clock_fall -clock jtag_inst1_TCK -max 0.321 [get_ports {jtag_inst1_SHIFT}]
set_input_delay -clock_fall -clock jtag_inst1_TCK -min 0.161 [get_ports {jtag_inst1_SHIFT}]
# JTAG Constraints (extra... not used by current Efinity debug tools)
# create_clock -period <USER_PERIOD> -name jtag_inst1_DRCK [get_ports {jtag_inst1_DRCK}]
# set_input_delay -clock_fall -clock jtag_inst1_TCK -max 0.267 [get_ports {jtag_inst1_RUNTEST}]
# set_input_delay -clock_fall -clock jtag_inst1_TCK -min 0.134 [get_ports {jtag_inst1_RUNTEST}]
# Create separate clock groups for JTAG clocks. Remove DRCK clock from the list below if it is not defined.
# set_clock_groups -asynchronous -group {jtag_inst1_TCK jtag_inst1_DRCK}

# DDR Constraints
###################
set_output_delay -clock dma_clk -reference_pin [get_ports {dma_clk~CLKOUT~337~166}] -max 2.500 [get_ports {io_ddrB_arw_payload_addr[*]}]
set_output_delay -clock dma_clk -reference_pin [get_ports {dma_clk~CLKOUT~337~166}] -min -0.400 [get_ports {io_ddrB_arw_payload_addr[*]}]
set_output_delay -clock dma_clk -reference_pin [get_ports {dma_clk~CLKOUT~337~166}] -max 2.500 [get_ports {io_ddrB_arw_payload_burst[*]}]
set_output_delay -clock dma_clk -reference_pin [get_ports {dma_clk~CLKOUT~337~166}] -min -0.400 [get_ports {io_ddrB_arw_payload_burst[*]}]
set_output_delay -clock dma_clk -reference_pin [get_ports {dma_clk~CLKOUT~337~166}] -max 2.500 [get_ports {io_ddrB_arw_payload_id[*]}]
set_output_delay -clock dma_clk -reference_pin [get_ports {dma_clk~CLKOUT~337~166}] -min -0.400 [get_ports {io_ddrB_arw_payload_id[*]}]
set_output_delay -clock dma_clk -reference_pin [get_ports {dma_clk~CLKOUT~337~166}] -max 2.500 [get_ports {io_ddrB_arw_payload_len[*]}]
set_output_delay -clock dma_clk -reference_pin [get_ports {dma_clk~CLKOUT~337~166}] -min -0.400 [get_ports {io_ddrB_arw_payload_len[*]}]
set_output_delay -clock dma_clk -reference_pin [get_ports {dma_clk~CLKOUT~337~166}] -max 2.500 [get_ports {io_ddrB_arw_payload_lock[*]}]
set_output_delay -clock dma_clk -reference_pin [get_ports {dma_clk~CLKOUT~337~166}] -min -0.400 [get_ports {io_ddrB_arw_payload_lock[*]}]
set_output_delay -clock dma_clk -reference_pin [get_ports {dma_clk~CLKOUT~337~166}] -max 2.500 [get_ports {io_ddrB_arw_payload_size[*]}]
set_output_delay -clock dma_clk -reference_pin [get_ports {dma_clk~CLKOUT~337~166}] -min -0.400 [get_ports {io_ddrB_arw_payload_size[*]}]
set_output_delay -clock dma_clk -reference_pin [get_ports {dma_clk~CLKOUT~337~166}] -max 2.500 [get_ports {io_ddrB_arw_payload_write}]
set_output_delay -clock dma_clk -reference_pin [get_ports {dma_clk~CLKOUT~337~166}] -min -0.400 [get_ports {io_ddrB_arw_payload_write}]
set_output_delay -clock dma_clk -reference_pin [get_ports {dma_clk~CLKOUT~337~166}] -max 2.500 [get_ports {io_ddrB_arw_valid}]
set_output_delay -clock dma_clk -reference_pin [get_ports {dma_clk~CLKOUT~337~166}] -min -0.400 [get_ports {io_ddrB_arw_valid}]
set_output_delay -clock dma_clk -reference_pin [get_ports {dma_clk~CLKOUT~337~166}] -max 2.500 [get_ports {io_ddrB_b_ready}]
set_output_delay -clock dma_clk -reference_pin [get_ports {dma_clk~CLKOUT~337~166}] -min -0.400 [get_ports {io_ddrB_b_ready}]
set_output_delay -clock dma_clk -reference_pin [get_ports {dma_clk~CLKOUT~337~166}] -max 2.500 [get_ports {io_ddrB_r_ready}]
set_output_delay -clock dma_clk -reference_pin [get_ports {dma_clk~CLKOUT~337~166}] -min -0.400 [get_ports {io_ddrB_r_ready}]
set_output_delay -clock dma_clk -reference_pin [get_ports {dma_clk~CLKOUT~337~166}] -max 2.500 [get_ports {io_ddrB_w_payload_data[*]}]
set_output_delay -clock dma_clk -reference_pin [get_ports {dma_clk~CLKOUT~337~166}] -min -0.400 [get_ports {io_ddrB_w_payload_data[*]}]
set_output_delay -clock dma_clk -reference_pin [get_ports {dma_clk~CLKOUT~337~166}] -max 2.500 [get_ports {io_ddrB_w_payload_id[*]}]
set_output_delay -clock dma_clk -reference_pin [get_ports {dma_clk~CLKOUT~337~166}] -min -0.400 [get_ports {io_ddrB_w_payload_id[*]}]
set_output_delay -clock dma_clk -reference_pin [get_ports {dma_clk~CLKOUT~337~166}] -max 2.500 [get_ports {io_ddrB_w_payload_last}]
set_output_delay -clock dma_clk -reference_pin [get_ports {dma_clk~CLKOUT~337~166}] -min -0.400 [get_ports {io_ddrB_w_payload_last}]
set_output_delay -clock dma_clk -reference_pin [get_ports {dma_clk~CLKOUT~337~166}] -max 2.500 [get_ports {io_ddrB_w_payload_strb[*]}]
set_output_delay -clock dma_clk -reference_pin [get_ports {dma_clk~CLKOUT~337~166}] -min -0.400 [get_ports {io_ddrB_w_payload_strb[*]}]
set_output_delay -clock dma_clk -reference_pin [get_ports {dma_clk~CLKOUT~337~166}] -max 2.500 [get_ports {io_ddrB_w_valid}]
set_output_delay -clock dma_clk -reference_pin [get_ports {dma_clk~CLKOUT~337~166}] -min -0.400 [get_ports {io_ddrB_w_valid}]
set_input_delay -clock dma_clk -reference_pin [get_ports {dma_clk~CLKOUT~337~166}] -max 3.000 [get_ports {io_ddrB_arw_ready}]
set_input_delay -clock dma_clk -reference_pin [get_ports {dma_clk~CLKOUT~337~166}] -min 1.500 [get_ports {io_ddrB_arw_ready}]
set_input_delay -clock dma_clk -reference_pin [get_ports {dma_clk~CLKOUT~337~166}] -max 3.000 [get_ports {io_ddrB_b_payload_id[*]}]
set_input_delay -clock dma_clk -reference_pin [get_ports {dma_clk~CLKOUT~337~166}] -min 1.500 [get_ports {io_ddrB_b_payload_id[*]}]
set_input_delay -clock dma_clk -reference_pin [get_ports {dma_clk~CLKOUT~337~166}] -max 3.000 [get_ports {io_ddrB_b_valid}]
set_input_delay -clock dma_clk -reference_pin [get_ports {dma_clk~CLKOUT~337~166}] -min 1.500 [get_ports {io_ddrB_b_valid}]
set_input_delay -clock dma_clk -reference_pin [get_ports {dma_clk~CLKOUT~337~166}] -max 3.000 [get_ports {io_ddrB_r_payload_data[*]}]
set_input_delay -clock dma_clk -reference_pin [get_ports {dma_clk~CLKOUT~337~166}] -min 1.500 [get_ports {io_ddrB_r_payload_data[*]}]
set_input_delay -clock dma_clk -reference_pin [get_ports {dma_clk~CLKOUT~337~166}] -max 3.000 [get_ports {io_ddrB_r_payload_id[*]}]
set_input_delay -clock dma_clk -reference_pin [get_ports {dma_clk~CLKOUT~337~166}] -min 1.500 [get_ports {io_ddrB_r_payload_id[*]}]
set_input_delay -clock dma_clk -reference_pin [get_ports {dma_clk~CLKOUT~337~166}] -max 3.000 [get_ports {io_ddrB_r_payload_last}]
set_input_delay -clock dma_clk -reference_pin [get_ports {dma_clk~CLKOUT~337~166}] -min 1.500 [get_ports {io_ddrB_r_payload_last}]
set_input_delay -clock dma_clk -reference_pin [get_ports {dma_clk~CLKOUT~337~166}] -max 3.000 [get_ports {io_ddrB_r_payload_resp[*]}]
set_input_delay -clock dma_clk -reference_pin [get_ports {dma_clk~CLKOUT~337~166}] -min 1.500 [get_ports {io_ddrB_r_payload_resp[*]}]
set_input_delay -clock dma_clk -reference_pin [get_ports {dma_clk~CLKOUT~337~166}] -max 3.000 [get_ports {io_ddrB_r_valid}]
set_input_delay -clock dma_clk -reference_pin [get_ports {dma_clk~CLKOUT~337~166}] -min 1.500 [get_ports {io_ddrB_r_valid}]
set_input_delay -clock dma_clk -reference_pin [get_ports {dma_clk~CLKOUT~337~166}] -max 3.000 [get_ports {io_ddrB_w_ready}]
set_input_delay -clock dma_clk -reference_pin [get_ports {dma_clk~CLKOUT~337~166}] -min 1.500 [get_ports {io_ddrB_w_ready}]
set_output_delay -clock axi_clk -reference_pin [get_ports {axi_clk~CLKOUT~337~282}] -max 2.500 [get_ports {io_ddrA_arw_payload_addr[*]}]
set_output_delay -clock axi_clk -reference_pin [get_ports {axi_clk~CLKOUT~337~282}] -min -0.400 [get_ports {io_ddrA_arw_payload_addr[*]}]
set_output_delay -clock axi_clk -reference_pin [get_ports {axi_clk~CLKOUT~337~282}] -max 2.500 [get_ports {io_ddrA_arw_payload_burst[*]}]
set_output_delay -clock axi_clk -reference_pin [get_ports {axi_clk~CLKOUT~337~282}] -min -0.400 [get_ports {io_ddrA_arw_payload_burst[*]}]
set_output_delay -clock axi_clk -reference_pin [get_ports {axi_clk~CLKOUT~337~282}] -max 2.500 [get_ports {io_ddrA_arw_payload_id[*]}]
set_output_delay -clock axi_clk -reference_pin [get_ports {axi_clk~CLKOUT~337~282}] -min -0.400 [get_ports {io_ddrA_arw_payload_id[*]}]
set_output_delay -clock axi_clk -reference_pin [get_ports {axi_clk~CLKOUT~337~282}] -max 2.500 [get_ports {io_ddrA_arw_payload_len[*]}]
set_output_delay -clock axi_clk -reference_pin [get_ports {axi_clk~CLKOUT~337~282}] -min -0.400 [get_ports {io_ddrA_arw_payload_len[*]}]
set_output_delay -clock axi_clk -reference_pin [get_ports {axi_clk~CLKOUT~337~282}] -max 2.500 [get_ports {io_ddrA_arw_payload_lock[*]}]
set_output_delay -clock axi_clk -reference_pin [get_ports {axi_clk~CLKOUT~337~282}] -min -0.400 [get_ports {io_ddrA_arw_payload_lock[*]}]
set_output_delay -clock axi_clk -reference_pin [get_ports {axi_clk~CLKOUT~337~282}] -max 2.500 [get_ports {io_ddrA_arw_payload_size[*]}]
set_output_delay -clock axi_clk -reference_pin [get_ports {axi_clk~CLKOUT~337~282}] -min -0.400 [get_ports {io_ddrA_arw_payload_size[*]}]
set_output_delay -clock axi_clk -reference_pin [get_ports {axi_clk~CLKOUT~337~282}] -max 2.500 [get_ports {io_ddrA_arw_payload_write}]
set_output_delay -clock axi_clk -reference_pin [get_ports {axi_clk~CLKOUT~337~282}] -min -0.400 [get_ports {io_ddrA_arw_payload_write}]
set_output_delay -clock axi_clk -reference_pin [get_ports {axi_clk~CLKOUT~337~282}] -max 2.500 [get_ports {io_ddrA_arw_valid}]
set_output_delay -clock axi_clk -reference_pin [get_ports {axi_clk~CLKOUT~337~282}] -min -0.400 [get_ports {io_ddrA_arw_valid}]
set_output_delay -clock axi_clk -reference_pin [get_ports {axi_clk~CLKOUT~337~282}] -max 2.500 [get_ports {io_ddrA_b_ready}]
set_output_delay -clock axi_clk -reference_pin [get_ports {axi_clk~CLKOUT~337~282}] -min -0.400 [get_ports {io_ddrA_b_ready}]
set_output_delay -clock axi_clk -reference_pin [get_ports {axi_clk~CLKOUT~337~282}] -max 2.500 [get_ports {io_ddrA_r_ready}]
set_output_delay -clock axi_clk -reference_pin [get_ports {axi_clk~CLKOUT~337~282}] -min -0.400 [get_ports {io_ddrA_r_ready}]
set_output_delay -clock axi_clk -reference_pin [get_ports {axi_clk~CLKOUT~337~282}] -max 2.500 [get_ports {io_ddrA_w_payload_data[*]}]
set_output_delay -clock axi_clk -reference_pin [get_ports {axi_clk~CLKOUT~337~282}] -min -0.400 [get_ports {io_ddrA_w_payload_data[*]}]
set_output_delay -clock axi_clk -reference_pin [get_ports {axi_clk~CLKOUT~337~282}] -max 2.500 [get_ports {io_ddrA_w_payload_id[*]}]
set_output_delay -clock axi_clk -reference_pin [get_ports {axi_clk~CLKOUT~337~282}] -min -0.400 [get_ports {io_ddrA_w_payload_id[*]}]
set_output_delay -clock axi_clk -reference_pin [get_ports {axi_clk~CLKOUT~337~282}] -max 2.500 [get_ports {io_ddrA_w_payload_last}]
set_output_delay -clock axi_clk -reference_pin [get_ports {axi_clk~CLKOUT~337~282}] -min -0.400 [get_ports {io_ddrA_w_payload_last}]
set_output_delay -clock axi_clk -reference_pin [get_ports {axi_clk~CLKOUT~337~282}] -max 2.500 [get_ports {io_ddrA_w_payload_strb[*]}]
set_output_delay -clock axi_clk -reference_pin [get_ports {axi_clk~CLKOUT~337~282}] -min -0.400 [get_ports {io_ddrA_w_payload_strb[*]}]
set_output_delay -clock axi_clk -reference_pin [get_ports {axi_clk~CLKOUT~337~282}] -max 2.500 [get_ports {io_ddrA_w_valid}]
set_output_delay -clock axi_clk -reference_pin [get_ports {axi_clk~CLKOUT~337~282}] -min -0.400 [get_ports {io_ddrA_w_valid}]
set_input_delay -clock axi_clk -reference_pin [get_ports {axi_clk~CLKOUT~337~282}] -max 3.000 [get_ports {io_ddrA_arw_ready}]
set_input_delay -clock axi_clk -reference_pin [get_ports {axi_clk~CLKOUT~337~282}] -min 1.500 [get_ports {io_ddrA_arw_ready}]
set_input_delay -clock axi_clk -reference_pin [get_ports {axi_clk~CLKOUT~337~282}] -max 3.000 [get_ports {io_ddrA_b_payload_id[*]}]
set_input_delay -clock axi_clk -reference_pin [get_ports {axi_clk~CLKOUT~337~282}] -min 1.500 [get_ports {io_ddrA_b_payload_id[*]}]
set_input_delay -clock axi_clk -reference_pin [get_ports {axi_clk~CLKOUT~337~282}] -max 3.000 [get_ports {io_ddrA_b_valid}]
set_input_delay -clock axi_clk -reference_pin [get_ports {axi_clk~CLKOUT~337~282}] -min 1.500 [get_ports {io_ddrA_b_valid}]
set_input_delay -clock axi_clk -reference_pin [get_ports {axi_clk~CLKOUT~337~282}] -max 3.000 [get_ports {io_ddrA_r_payload_data[*]}]
set_input_delay -clock axi_clk -reference_pin [get_ports {axi_clk~CLKOUT~337~282}] -min 1.500 [get_ports {io_ddrA_r_payload_data[*]}]
set_input_delay -clock axi_clk -reference_pin [get_ports {axi_clk~CLKOUT~337~282}] -max 3.000 [get_ports {io_ddrA_r_payload_id[*]}]
set_input_delay -clock axi_clk -reference_pin [get_ports {axi_clk~CLKOUT~337~282}] -min 1.500 [get_ports {io_ddrA_r_payload_id[*]}]
set_input_delay -clock axi_clk -reference_pin [get_ports {axi_clk~CLKOUT~337~282}] -max 3.000 [get_ports {io_ddrA_r_payload_last}]
set_input_delay -clock axi_clk -reference_pin [get_ports {axi_clk~CLKOUT~337~282}] -min 1.500 [get_ports {io_ddrA_r_payload_last}]
set_input_delay -clock axi_clk -reference_pin [get_ports {axi_clk~CLKOUT~337~282}] -max 3.000 [get_ports {io_ddrA_r_payload_resp[*]}]
set_input_delay -clock axi_clk -reference_pin [get_ports {axi_clk~CLKOUT~337~282}] -min 1.500 [get_ports {io_ddrA_r_payload_resp[*]}]
set_input_delay -clock axi_clk -reference_pin [get_ports {axi_clk~CLKOUT~337~282}] -max 3.000 [get_ports {io_ddrA_r_valid}]
set_input_delay -clock axi_clk -reference_pin [get_ports {axi_clk~CLKOUT~337~282}] -min 1.500 [get_ports {io_ddrA_r_valid}]
set_input_delay -clock axi_clk -reference_pin [get_ports {axi_clk~CLKOUT~337~282}] -max 3.000 [get_ports {io_ddrA_w_ready}]
set_input_delay -clock axi_clk -reference_pin [get_ports {axi_clk~CLKOUT~337~282}] -min 1.500 [get_ports {io_ddrA_w_ready}]

# Clock Latency Constraints
############################
# set_clock_latency -source -setup <board_max + 1.476> [get_ports {tx_slowclk}]
# set_clock_latency -source -hold <board_min + 0.738> [get_ports {tx_slowclk}]
# set_clock_latency -source -setup <board_max + 1.476> [get_ports {tx_fastclk}]
# set_clock_latency -source -hold <board_min + 0.738> [get_ports {tx_fastclk}]
